Repository: shatanourhan/Airfoil
Catalog: ToolTips_*.resx
Languages: de

# btnAutoSearch
source: Automatically search for well-fitting control points for both curves. Three other points per control point are recursively tried. The search distance is Error / 50 (vertical only). If no better points are found, four other points per control point are tried, and so on. If the improvement through different control point positions is less than 10%, the degree of the curve is increased by 1. Then search again. This continues until the error is less than 0.075. The search can be interrupted with the stop button.
de: Automatisch nach gut passenden Kontrollpunkten für beide Kurven suchen. Es werden rekursiv 3 andere Punkte pro Kontrollpunkt ausprobiert. Der Suchradius ist Error / 100 (nur vertikal). Wenn da nichts besseres dabei war, werden 4 andere Punkte pro Kontrollpunkt probiert. Und so weiter. Wenn die Verbesserung durch andere Positionen der Kontrollpunkte unter 10% liegt, wird der Grad der Kurve um 1 erhöht. Dann wieder suchen. So lange, bis der Error unter 0.075 liegt. Die Suche kann mit der Stopp-Taste unterbrochen werden.

# btnAxisAuto
source: Resets the Zoom to fit Data.
de: Passt den Zoom an die dargestellten Daten an.

# btnDecreaseOrderBottom
source: Decrease the order of the bottom bezier curve while preserving the shape.
de: Den Grad der unteren Bezierkurve verringern, während die Form beibehalten wird.

# btnDecreaseOrderTop
source: Decrease the order of the top bezier curve while preserving the shape.
de: Den Grad der oberen Bezierkurve verringern, während die Form beibehalten wird.

# btnDefault
source: Load the default control points.
de: Die Standard Kontrollpunkte laden.

# btnIncreaseOrderBottom
source: Increase the order of the bottom bezier curve while preserving the shape.
de: Den Grad der unteren Bezierkurve erhöhen, während die Form beibehalten wird.

# btnIncreaseOrderTop
source: Increase the order of the top bezier curve while preserving the shape.
de: Den Grad der oberen Bezierkurve erhöhen, während die Form beibehalten wird.

# btnLoadBez
source: Load control points from a .bez file.
de: Die Kontrollpunkte aus einer .bez Datei laden.

# btnLoadBezDat
source: Load control points from a .bez.dat file.
de: Die Kontrollpunkte aus einer .bez.dat Datei laden.

# btnLoadDat
source: Load a reference airfoil from a .dat file. Right-click to remove the reference airfoil.
de: Ein Referenzprofil aus einer .dat Datei laden. Rechtsklick zum entfernen.

# btnSaveBez
source: Save the current control points as a .bez file. The formatting differs from normal .dat files. The control points at the LE and TE don't have to be identical for the top and bottom curves. This allows the definition of other geometry as bezier curves, for example, the wing planform. Currently, this is not supported by other software, but theoretically it is a better file type. File format example: Airfoil Name Top Start 0.00000000 0.00000000 0.00000000 0.15000000 0.50000000 0.15000000 1.00000000 0.00000000 Top End Bottom Start 0.00000000 0.00000000 0.00000000 -0.10000000 0.50000000 -0.10000000 1.00000000 0.00000000 Bottom End
de: Speichern der aktuellen Kontrollpunkte als .bez-Datei. Das Format unterscheidet sich von normalen .dat-Dateien. Die Kontrollpunkte am Nasen- und Endleiste müssen für die oberen und unteren Kurven nicht identisch sein. Dies ermöglicht die Definition anderer Formen durch Bezierkurven, zum Beispiel den Flügelgrundriss. Derzeit nicht von anderer Software unterstützt, aber theoretisch ein besseres Dateiformat. Beispiel Dateiformat: Airfoil Name Top Start 0.00000000 0.00000000 0.00000000 0.15000000 0.50000000 0.15000000 1.00000000 0.00000000 Top End Bottom Start 0.00000000 0.00000000 0.00000000 -0.10000000 0.50000000 -0.10000000 1.00000000 0.00000000 Bottom End

# btnSaveBezDat
source: Save the current control points as a .bez.dat file. The formatting is identical to normal .dat files. This allows the control points to be easily loaded into most other programs. File format example: Airfoil Name 1.00000000 0.00000000 0.50000000 0.15000000 0.00000000 0.15000000 0.00000000 0.00000000 0.00000000 -0.10000000 0.50000000 -0.10000000 1.00000000 0.00000000
de: Speichern der aktuellen Kontrollpunkte als .bez.dat Datei. Das Format ist identisch mit normalen .dat Dateien. Erlaubt das einfache Importieren der Kontrollpunkte in die meisten anderen Programme. Beispiel Dateiformat: Airfoil Name 1.00000000 0.00000000 0.50000000 0.15000000 0.00000000 0.15000000 0.00000000 0.00000000 0.00000000 -0.10000000 0.50000000 -0.10000000 1.00000000 0.00000000

# btnSaveDat
source: Save the current curves as a .dat file.
de: Die aktuellen Kurven als .dat Datei speichern.

# btnSearchBottom
source: Search for better control points for the bottom curve. Right click to do a single search.
de: Nach besseren Kontrollpunkten für die untere Kurve suchen. Rechtsklick, um eine einzelne Suche durchzuführen.

# btnSearchTop
source: Search for better control points for the top curve. Right click to do a single search.
de: Nach besseren Kontrollpunkten für die obere Kurve suchen. Rechtsklick, um eine einzelne Suche durchzuführen.

# btnStartPSOBottom
source: Start a Particle Swarm Optimization for the bottom curve.
de: Eine Partikel-Schwarm-Optimierung für die untere Kurve starten.

# btnStartPSOTop
source: Start a Particle Swarm Optimization for the top curve.
de: Eine Partikel-Schwarm-Optimierung für die obere Kurve starten.

# btnStopSearch
source: Stop the currently running search.
de: Die aktuelle Suche abbrechen.

# chkShowBottom
source: Show or hide the bottom curve.
de: Die untere Kurve anzeigen oder ausblenden.

# chkShowCamber
source: Show or hide the camber line.
de: Die Wölbungslinie anzeigen oder ausblenden.

# chkShowControlBottom
source: Show or hide the control points for the bottom curve.
de: Die Kontrollpunkte für die untere Kurve anzeigen oder ausblenden.

# chkShowControlTop
source: Show or hide the control points for the top curve.
de: Die Kontrollpunkte für die obere Kurve anzeigen oder ausblenden.

# chkShowRadius
source: Show or hide the leading edge radius.
de: Den Radius an der Vorderkante anzeigen oder ausblenden.

# chkShowReferenceBottom
source: Show or hide the bottom of the reference airfoil.
de: Die Unterseite des Referenzprofils anzeigen oder ausblenden.

# chkShowReferenceTop
source: Show or hide the top of the reference airfoil.
de: Die Oberseite des Referenzprofils anzeigen oder ausblenden.

# chkShowThickness
source: Show or hide the thickness distribution.
de: Die Dickenverteilung anzeigen oder ausblenden.

# chkShowTop
source: Show or hide the top curve.
de: Die obere Kurve anzeigen oder ausblenden.

# txtCamberPosition
source: Set the position at which the camber line is calculated.
de: Die Position festlegen, an der die Wölbungslinie berechnet wird.

# txtCamberStepSize
source: Set the step size at which the camber line is calculated.
de: Die Schrittweite festlegen, mit der die Wölbungslinie berechnet wird.

# txtChord
source: Sets the chord used during export.
de: Legt die Profiltiefe fest, mit der die Koordinaten exportiert werden.

# txtNumOfPointBottom
source: Set the number of points on the bottom bezier curve.
de: Die Anzahl der Punkte auf der unteren Bezierkurve festlegen.

# txtNumOfPointsTop
source: Set the number of points on the top bezier curve.
de: Die Anzahl der Punkte auf der oberen Bezierkurve festlegen.

# txtThicknessStepSize
source: Set the step size at which the thickness line is calculated.
de: Den Schrittweite festlegen, mit der die Dickenlinie berechnet wird.
